In [1]:
import numpy as np
import pandas as pd

In [2]:
pop2014 = pd.Series([100,99.3,95.5,93.5,92.4,84.8,84.5,78.9,74.3,72.8],
                    index=['Java','C','C++','Python','C#','PHP','JavaScript','Ruby','R','Matlab'])

In [3]:
pop2015 = pd.Series({'Java': 100,'C': 99.9,'C++': 99.4,'Python': 96.5,'C#': 91.3,
                     'R': 84.8,'PHP': 84.5,'JavaScript': 83.0,'Ruby': 76.2,'Matlab': 72.4})

In [5]:
'Creating DataFrames from two serieses'
'The indexs will be match automaticly'
twoyears = pd.DataFrame({'2014':pop2014, '2015':pop2015} )

In [6]:
twoyears

             2014   2015
C            99.3   99.9
C#           92.4   91.3
C++          95.5   99.4
Java        100.0  100.0
JavaScript   84.5   83.0
Matlab       72.8   72.4
PHP          84.8   84.5
Python       93.5   96.5
R            74.3   84.8
Ruby         78.9   76.2

In [9]:
'Sorting the data'
twoyears = twoyears.sort('2015',ascending=False)

AttributeError: 'DataFrame' object has no attribute 'sort'

In [10]:
twoyears

             2014   2015
C            99.3   99.9
C#           92.4   91.3
C++          95.5   99.4
Java        100.0  100.0
JavaScript   84.5   83.0
Matlab       72.8   72.4
PHP          84.8   84.5
Python       93.5   96.5
R            74.3   84.8
Ruby         78.9   76.2

In [12]:
'Since pandas build on top of the numpy arry'
twoyears['avg'] = 0.5 * (twoyears['2014'] + twoyears['2015'])

In [13]:
twoyears

             2014   2015     avg
C            99.3   99.9   99.60
C#           92.4   91.3   91.85
C++          95.5   99.4   97.45
Java        100.0  100.0  100.00
JavaScript   84.5   83.0   83.75
Matlab       72.8   72.4   72.60
PHP          84.8   84.5   84.65
Python       93.5   96.5   95.00
R            74.3   84.8   79.55
Ruby         78.9   76.2   77.55

In [14]:
'Create new DataFrame ansd specify avery row as a dictionary item'
presidents = pd.DataFrame([{'name': 'Barack Obama','inauguration': 2009,'birthyear': 1961},
                          {'name': 'George W. Bush','inauguration': 2001,'birthyear': 1946},
                          {'name': 'Bill Clinton','birthyear': 1946,'inauguration': 1993},
                          {'name': 'George H. W. Bush','inauguration': 1989,'birthyear': 1924}])

In [15]:
presidents

   birthyear  inauguration               name
0       1961          2009       Barack Obama
1       1946          2001     George W. Bush
2       1946          1993       Bill Clinton
3       1924          1989  George H. W. Bush

In [16]:
'Choose one of the column to be the index using the "SET_INDEX" function'
presidents_indexes = presidents.set_index('name')

In [17]:
presidents_indexes

                   birthyear  inauguration
name
Barack Obama            1961          2009
George W. Bush          1946          2001
Bill Clinton            1946          1993
George H. W. Bush       1924          1989

In [18]:
'When doing theis, we can ask questions explicity about the column data'
'Using the LOCK function to index rows'
presidents_indexes.loc['Bill Clinton']

birthyear       1946
inauguration    1993
Name: Bill Clinton, dtype: int64

In [19]:
presidents_indexes.loc['Bill Clinton']['inauguration']

1993

In [20]:
'Simple JOIN operation on DataFrame using the MERGE'
'For that, forst we need a new table to stores the results of the operation'
'The variables are - thable name1, tavle name2, column to be joined'
presidents_fathers = pd.DataFrame([{'son': 'Barack Obama','father': 'Barack Obama, Sr.'},
                                   {'son': 'George W. Bush','father': 'George H. W. Bush'},
                                   {'son': 'George H. W. Bush','father': 'Prescott Bush'}])

In [22]:
pd.merge(presidents,presidents_fathers,left_on='name',right_on='son')

,birthyear,inauguration,name,father,son
0,1961,2009,Barack Obama,"Barack Obama, Sr.",Barack Obama
1,1946,2001,George W. Bush,George H. W. Bush,George W. Bush
2,1924,1989,George H. W. Bush,Prescott Bush,George H. W. Bush

In [24]:
'We got duplicate columns (name and son) so we use the command "DROP" to remive them'
pd.merge(presidents,presidents_fathers,left_on='name',right_on='son').drop('son',axis=1)

   birthyear  inauguration               name             father
0       1961          2009       Barack Obama  Barack Obama, Sr.
1       1946          2001     George W. Bush  George H. W. Bush
2       1924          1989  George H. W. Bush      Prescott Bush

In [26]:
'The join omitted (inner join) the rowas of clinton since it does not exists in one of the tables'
'We can do a differnt join to includes un-matched rows using the HOW = LEFT value'
pd.merge(presidents,presidents_fathers,left_on='name',right_on='son',how='left').drop('son',axis=1)

   birthyear  inauguration               name             father
0       1961          2009       Barack Obama  Barack Obama, Sr.
1       1946          2001     George W. Bush  George H. W. Bush
2       1946          1993       Bill Clinton                NaN
3       1924          1989  George H. W. Bush      Prescott Bush

In [27]:
pd.DataFrame(np.random.choice(['a','b','c','d'],(3,3)),index=[1,2,3],columns=['A','B','C'])

   A  B  C
1  c  d  a
2  a  c  d
3  a  c  a